app/controllers/estudiantes_controller.rb

SELECT "estudiantes".* FROM "estudiantes"
---
  def index
    @estudiantes = Estudiante.all

INSERT INTO "estudiantes" ("nombres", "apellidos", "carrera", "carnet", "fecha_nacimiento", "edad", "celular", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @estudiante = Estudiante.new(estudiante_params)

    respond_to do |format|
      if @estudiante.save

UPDATE "estudiantes" SET "carnet" = ?, "updated_at" = ? WHERE "estudiantes"."id" = ?  [["carnet", "18-48480-0"], ["updated_at", "2023-10-04 16:01:11.123054"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @estudiante.update(estudiante_params)

DELETE FROM "estudiantes" WHERE "estudiantes"."id" = ?  [["id", 2]]
---
  def destroy
    @estudiante.destroy

SELECT "estudiantes".* FROM "estudiantes" WHERE "estudiantes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_estudiante
      @estudiante = Estudiante.find(params[:id])